cask_args appdir: '/Applications'

tap "Homebrew/bundle"
tap "Homebrew/cask-fonts"
tap "Homebrew/cask-versions"

# Doesn't exist yet
#brew "flutter"
# Provided by Docker for Mac
#brew "kubernetes-cli"
brew "automake"
brew "bat"
brew "bzr"
brew "cmake"
brew "direnv"
brew "docker-compose"
brew "docker-machine-driver-hyperkit"
brew "exa"
brew "fish"
brew "fzf"
brew "git"
brew "go"
brew "gpg2"
brew "hub"
brew "jq"
brew "kubernetes-helm"
brew "libtool"
brew "mas"
brew "mdv"
brew "ninja"
brew "npm"
brew "pulumi"
brew "ripgrep"
brew "rustup"
brew "yarn"

cask "alacritty"
cask "android-sdk"
cask "docker"
cask "firefox-developer-edition"
cask "font-firacode-nerd-font-mono"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "keybase"
cask "kitty"
cask "minikube"
cask "seaglass"
cask "signal"
cask "slack"
cask "typora"
cask "virtualbox"
cask "visual-studio-code"
cask "wavebox"

mas "1Password", id: 1333542190
